Repository: ojs-services/trendMDojs
Catalog: locale/*/locale.po
Languages: tr_tr

# plugins.generic.trendMDojs.displayName
source: TrendMD Widget Plugin
tr_tr: TrendMD Öneri Aracı Eklentisi

# plugins.generic.trendMDojs.description
source: Integrates the TrendMD article recommendation widget into article pages using your journal's unique TrendMD identifier.
tr_tr: Dergiye özel TrendMD tanımlayıcısı kullanarak makale sayfalarına TrendMD makale öneri aracını entegre eder.

# plugins.generic.trendMDojs.guide.title
source: How This Plugin Works
tr_tr: Bu Eklenti Nasıl Çalışır?

# plugins.generic.trendMDojs.guide.intro
source: TrendMD displays personalized article recommendations on your journal pages. Each journal has a unique identifier (UUID) assigned by TrendMD. This plugin handles the complete technical integration â€” you only need to enter your journal's identifier.
tr_tr: TrendMD, dergi sayfalarınızda kişiselleştirilmiş makale önerileri görüntüler. Her derginin TrendMD tarafından atanmış benzersiz bir tanımlayıcısı (UUID) vardır. Bu eklenti tüm teknik entegrasyonu otomatik olarak yönetir — yalnızca derginizin tanımlayıcısını girmeniz yeterlidir.

# plugins.generic.trendMDojs.guide.autoTitle
source: Managed automatically by this plugin:
tr_tr: Bu eklenti tarafından otomatik yönetilir:

# plugins.generic.trendMDojs.guide.autoScript
source: TrendMD JavaScript library loaded in the page header
tr_tr: TrendMD JavaScript kütüphanesi sayfa başlığına yüklenir

# plugins.generic.trendMDojs.guide.autoDiv
source: Widget container placed at your chosen position on article pages
tr_tr: Araç kapsayıcısı makale sayfalarında seçtiğiniz konuma yerleştirilir

# plugins.generic.trendMDojs.guide.generatedCode
source: Code generated by the plugin:
tr_tr: Eklenti tarafından oluşturulan kod:

# plugins.generic.trendMDojs.guide.youDoTitle
source: What you need to do:
tr_tr: Yapmanız gereken:

# plugins.generic.trendMDojs.guide.youDoText
source: Enter your journal's TrendMD identifier below. You can find this UUID in your TrendMD dashboard or from your TrendMD account representative.
tr_tr: Aşağıya derginizin TrendMD tanımlayıcısını girin. Bu UUID'yi TrendMD kontrol panelinizden veya TrendMD hesap temsilcinizden öğrenebilirsiniz.

# plugins.generic.trendMDojs.guide.exampleFormat
source: Example: d388f983-22f3-4d5c-83a9-1389a369bb94
tr_tr: Örnek: d388f983-22f3-4d5c-83a9-1389a369bb94

# plugins.generic.trendMDojs.settings.identifierSection
source: TrendMD Journal Identifier
tr_tr: TrendMD Dergi Tanımlayıcısı

# plugins.generic.trendMDojs.settings.identifierLabel
source: Journal Identifier (UUID)
tr_tr: Dergi Tanımlayıcısı (UUID)

# plugins.generic.trendMDojs.settings.identifierHelp
source: The unique identifier assigned to your journal by TrendMD. Format: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
tr_tr: TrendMD tarafından derginize atanmış benzersiz tanımlayıcı. Format: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx

# plugins.generic.trendMDojs.settings.confirmNoIdentifier
source: No identifier entered. A placeholder notice will appear on article pages instead of recommendations. Save anyway?
tr_tr: Tanımlayıcı girilmedi. Makale sayfalarında öneriler yerine bir bilgilendirme notu görünecektir. Yine de kaydetmek istiyor musunuz?

# plugins.generic.trendMDojs.settings.displaySection
source: Display Options
tr_tr: Görüntüleme Seçenekleri

# plugins.generic.trendMDojs.settings.positionLabel
source: Widget Position
tr_tr: Araç Konumu

# plugins.generic.trendMDojs.settings.cssClassLabel
source: Custom CSS Class
tr_tr: Özel CSS Sınıfı

# plugins.generic.trendMDojs.settings.cssClassHelp
source: Optional. Add a custom CSS class to the widget wrapper for theme-specific styling.
tr_tr: İsteğe bağlı. Temaya özel stil için araç kapsayıcısına özel bir CSS sınıf adı ekleyin.

# plugins.generic.trendMDojs.position.articleMain
source: Article Summary
tr_tr: Makale Özeti

# plugins.generic.trendMDojs.position.articleMainHint
source: Below the abstract (default)
tr_tr: Özetin altında (varsayılan)

# plugins.generic.trendMDojs.position.articleDetail
source: Article Details
tr_tr: Makale Detayları

# plugins.generic.trendMDojs.position.articleDetailHint
source: Sidebar area
tr_tr: Kenar çubuğu alanı

# plugins.generic.trendMDojs.position.articleFooter
source: Page Footer
tr_tr: Sayfa Alt Bilgisi

# plugins.generic.trendMDojs.position.articleFooterHint
source: Bottom of the article page
tr_tr: Makale sayfasının en altı

# plugins.generic.trendMDojs.validate.btnLabel
source: Validate Identifier
tr_tr: Tanımlayıcıyı Doğrula

# plugins.generic.trendMDojs.validate.checking
source: Validating...
tr_tr: Doğrulanıyor...

# plugins.generic.trendMDojs.validate.success
source: UUID format is valid. Save the settings and check an article page on your site to confirm the widget is working.
tr_tr: UUID formatı geçerli. Ayarları kaydedin ve aracın çalıştığını doğrulamak için sitenizdeki bir makale sayfasını kontrol edin.

# plugins.generic.trendMDojs.validate.empty
source: No identifier entered. Please paste your journal's TrendMD UUID.
tr_tr: Tanımlayıcı girilmedi. Lütfen derginizin TrendMD UUID'sini yapıştırın.

# plugins.generic.trendMDojs.validate.invalidFormat
source: Invalid UUID format. Expected: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
tr_tr: Geçersiz UUID formatı. Beklenen: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx

# plugins.generic.trendMDojs.validate.hasSpaces
source: The identifier contains spaces. Please remove any extra spaces.
tr_tr: Tanımlayıcı boşluk içeriyor. Lütfen fazla boşlukları kaldırın.

# plugins.generic.trendMDojs.validate.wrongLength
source: Incorrect length. A valid UUID is 36 characters including hyphens.
tr_tr: Yanlış uzunluk. Geçerli bir UUID tireler dahil 36 karakter uzunluğundadır.

# plugins.generic.trendMDojs.validate.error
source: Validation failed. Please try again.
tr_tr: Doğrulama başarısız oldu. Lütfen tekrar deneyin.

# plugins.generic.trendMDojs.placeholder.message
source: This plugin is active but no journal identifier has been configured. Please enter your TrendMD UUID in the plugin settings, or disable the plugin.
tr_tr: Bu eklenti aktif ancak dergi tanımlayıcısı yapılandırılmamıştır. Lütfen eklenti ayarlarından TrendMD UUID'nizi girin veya kullanmıyorsanız eklentiyi devre dışı bırakın.
